# 1) Сумму ряда 0 - 88888888
s = sum(range(0, 88888888))
print(' Задание 1 --- ',s)

# 2) Среднее арифметическое ряда [3, 4, 56, 100, 2, 2, 3]
arr = [3, 4, 56, 100, 2, 2, 3]
print(' Задание 2 --- ', sum(arr) / len(arr))
        
        
# 3) Заменить в строке "asdxfghyxyx" все буквы "х" на "у"
s = "asdxfghyxyx"
print(' Задание 3 --- ', s.replace('x', 'y'))
# 4) Сосчитать произведение чисел [3, 4, 56, 100, 15, 2, 20, 30],
#    кратных и 3 и 5.

# 5) Заменить все буквы "x" на "у" в исходной
#    строке без использования дополнительной.